# Anscombe Quartet

In 1973, Frank Anscombe introduced a set of four data sets with a peculiar relationship. In this warm-up activity, you will explore that relationship.

1. Form a team of 4 people. Assign each member of the team a different number from 1 to 4.
2. In the `/data/anscombe/` directory are four data sets: `data1.csv`, `data2.csv`, `data3.csv`, and `data4.csv`. **You are only allowed to look at the data set corresponding to your number.**
3. Without showing your data set to your teammates, try to explain what your data set looks like to your teammates. It may be helpful to calculate summary statistics, like means and standard deviations.
4. As a team, try to figure out what is similar and different between your data sets, **without looking at each other's data sets**.

In [1]:
import pandas as pd

data = pd.read_csv("/data/anscombe/data3.csv")

In [3]:
data

     x      y
0   10   7.46
1    8   6.77
2   13  12.74
3    9   7.11
4   11   7.81
5   14   8.84
6    6   6.08
7    4   5.39
8   12   8.15
9    7   6.42
10   5   5.73

In [21]:
data.corr(method="pearson")

          x         y
x  1.000000  0.816287
y  0.816287  1.000000